/*
王a、李b、杜c三人大学毕业后，一个当上了公务员1，一个当上了空姐2，另一个当上了司机3。他们各自作了如下陈述：
王：王当上了公务员，李当上了空姐；
李：王当上了空姐，杜当上了公务员；
杜：王当上了司机，李当上了公务员；
结果证实，王、李、杜的陈述都只对了一半，那么他们各自的职业是什么？
*/
/*
#include <iostream>
using namespace std;
int main()
{
	int a,b,c,aa,bb,cc;
	for(a=1;a<=3;a++)
		for(b=1;b<=3;b++)
			for(c=1;c<=3;c++)
				if(a!=b&&a!=c&&b!=c)
				{
					aa=((a==1)^(b==2));
					bb=((a==2)^(c==1));
					cc=((a==3)^(b==1));
					if(aa&&bb&&cc)
						cout<<a<<" "<<b<<" "<<c<<endl;
				}

}

#include <stdio.h>

int main()
{
	int a, b, c;
	int aa, bb, cc;
	
	for(a=1; a<=3; a++)
	for(b=1; b<=3; b++)
	for(c=1; c<=3; c++)
	{
		if(a == b || a==c || b == c)
		    continue;
		
		aa=((a==1)+(b==2)) == 1? 1: 0;
		bb=((a==2)+(c==1)) == 1? 1: 0;
		cc=((a==3)+(b==1)) == 1? 1: 0;
		if(aa + bb + cc == 3)
		    printf("王 = %d，李 = %d，杜 = %d\n", a, b, c);
	}
	
}*/
/*
有4名专家对4款赛车进行评论.
A说：2号赛车是最好的.
B说：4号赛车是最好的.
C说：3号不是最佳赛车.
D说：B说错了.
事实上只有1 款赛车最佳,且只有一名专家说对了,其他3 人都说错了.请编程输出
最佳车的车号,以及哪位专家说对了.
*/
#include <stdio.h>

int main()
{
	int a, b[4];
	for(a=1; a<=4; a++)
	{
		b[0] = (a == 2);
		b[1] = (a == 4);
		b[2] = (a != 3);
		b[3] = (b[1] == 0);
		if(b[0] + b[1] + b[2] + b[3] == 1)
		{
			printf("第%d是最好的\n", a);
			
			for(a=0; (b[a] != 1); a++);
			printf("第%d个教练说对了\n", a+1);
			
		}
	}
	
}